/*!
*******************************************************************************
\file str.h
\brief Управление строками
*//****************************************************************************
\author (С) Сергей Агиевич, http://apmi.bsu.by
\created 2013.02.04
\version 2014.10.21
*******************************************************************************
*/

#ifndef __STR_H
#define __STR_H

#include "defs.h"
#include <string.h>

#ifdef __cplusplus
extern "C" {
#endif

/*!
*******************************************************************************
\file str.h

Реализованы или переопределены манипуляции над строками. Строка
представляет собой последовательность символов-октетов, которая
заканчивается нулевым октетом.

\pre В функции передаются корректные буферы памяти.

todo: safe = {strCmp?, strIsHex?}
*******************************************************************************
*/

/*
*******************************************************************************
Псевдонимы стандартных функций
*******************************************************************************
*/

/*!	Возвращается длина строки (число символов до завершающего нулевого).
*/
#define strLen(str) strlen(str)

/*!	Возвращается strLen(str), если strLen(str) < count, или count в противном
	случае.
*/
#define strLen2(str, count) strnlen(str, count)

/*!	Строка src копируется в dest.
	\pre По адресу dest зарезервировано strLen(src) + 1 октетов.
	\pre Буферы src и dest не пересекаются.
*/
#define strCopy(dest, src) strcpy(dest, src)

/*!	Строки str1 и str2 сравниваются лексикографически.
	\return 1, если str1 > str2, или -1, если str1 < str2,
	или 0, если str1 == str2.
*/
#define strCmp(str1, str2) strcmp(str1, str2)

/*
*******************************************************************************
Дополнительные функции
*******************************************************************************
*/

/*!	\brief Корректная строка?

	Проверяется, что строка str корректна.
	\return Проверяемый признак.
*/
bool_t strIsValid(
	const char* str		/*!< [in] строка */
);

/*!	\brief Шестнадцатеричная строка?

	Проверяется, что строка str состоит из шестнадцатеричных символов 
	'0' -- '9', 'A' -- 'F' (в верхнем или нижнем регистрах).
	\pre Строка корректна.
	\return Проверяемый признак.
*/
bool_t strIsHex(
	const char* str		/*!< [in] строка */
);

#ifdef __cplusplus
} /* extern "C" */
#endif

#endif /* __STR_H */
